hotel_eel_api/app/controllers/api/enquiries_controller.rb

SELECT "enquiries".* FROM "enquiries"
---
  def index
    render json: Enquiry.all

INSERT INTO "enquiries" ("guest_name", "guest_phone", "room_type", "board_type", "number_of_guests", "start_date", "end_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["guest_name", "test9"], ["guest_phone", "test9"], ["room_type", "Standard"], ["board_type", ""], ["number_of_guests", 1], ["start_date", "2021-05-06"], ["end_date", "2021-05-07"]]
---
  def create
    enquiry = Enquiry.create(
      guest_name: params[:guest_name],
      guest_phone: params[:guest_phone],
      guest_email: params[:guest_email],
      room_type: params[:room_type],
      board_type: params[:board_type],
      number_of_guests: params[:number_of_guests],
      start_date: params[:start_date],
      end_date: params[:end_date]
    )

SELECT "enquiries".* FROM "enquiries" WHERE "enquiries"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
  def show
    render json: Enquiry.find(params[:id])

SELECT "enquiries".* FROM "enquiries" WHERE "enquiries"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "enquiries" SET "guest_name" = $1, "guest_phone" = $2, "guest_email" = $3, "room_type" = $4, "board_type" = $5, "number_of_guests" = $6, "start_date" = $7, "end_date" = $8 WHERE "enquiries"."id" = $9  [["guest_name", ""], ["guest_phone", ""], ["guest_email", ""], ["room_type", ""], ["board_type", ""], ["number_of_guests", nil], ["start_date", nil], ["end_date", nil], ["id", 36]]
---
  def update
    enquiry = Enquiry.find(params[:id])
    enquiry.update(
      guest_name: params[:guest_name],
      guest_phone: params[:guest_phone],
      guest_email: params[:guest_email],
      room_type: params[:room_type],
      board_type: params[:board_type],
      number_of_guests: params[:number_of_guests],
      start_date: params[:start_date],
      end_date: params[:end_date]
    )

DELETE FROM "enquiries" WHERE "enquiries"."id" = $1  [["id", 23]]
---
  def destroy
    Enquiry.destroy(params[:id])