hotel_eel_api/app/controllers/api/users_controller.rb

INSERT INTO "users" ("name", "password_digest") VALUES ($1, $2) RETURNING "id"  [["name", "test2"], ["password_digest", "$2a$12$nduh7Xvb6CuuPRMiGFHFhedmgcnQx7rQlnd3VopREXtfQF7IZrzp."]]
---
  def create
    user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    puts params[:id]
    render json: User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["name", "test_1"], ["password_digest", "$2a$12$7d29oev/lqkwRAxGFMiq3uvaeAiGwoEn.stPo2esn.B490tZdsLVi"], ["id", 2]]
---
  def update
    render json: User.find(params[:id]).update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    User.destroy(params[:id])