hotel_eel_api/app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards"
---
    def index
        render json: Board.all

INSERT INTO "boards" ("board_type", "board_rate_per_person") VALUES ($1, $2) RETURNING "id"  [["board_type", "Half Board"], ["board_rate_per_person", "ksh7000"]]
---
      def create
        board = Board.create(board_type: params[:board_type], board_rate_per_person: params[:board_rate_per_person])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def show
        render json: Board.find(params[:id])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "boards" SET "board_type" = $1, "board_rate_per_person" = $2 WHERE "boards"."id" = $3  [["board_type", "Half-Board"], ["board_rate_per_person", "Ksh 7000"], ["id", 2]]
---
      def update
        board = Board.find(params[:id])
        board.update(board_type: params[:board_type], board_rate_per_person: params[:board_rate_per_person])

DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 3]]
---
      def destroy
        Board.destroy(params[:id])