hotel_eel_api/app/controllers/enquiries_controller.rb

  def index
    render json: Enquiry.all
---
SELECT "enquiries".* FROM "enquiries"

  def create
    enquiry = Enquiry.create(
      guest_name: params[:guest_name],
      guest_phone: params[:guest_phone],
      guest_email: params[:guest_email],
      room_type: params[:room_type],
      board_type: params[:board_type],
      number_of_guests: params[:number_of_guests],
      start_date: params[:start_date],
      end_date: params[:end_date]
    )
---
INSERT INTO "enquiries" ("guest_name", "guest_phone", "guest_email", "room_type", "number_of_guests", "start_date", "end_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["guest_name", "Test2"], ["guest_phone", "3"], ["guest_email", "test2@test2.com.au"], ["room_type", "cottage"], ["number_of_guests", 3], ["start_date", "2021-05-03"], ["end_date", "2021-05-15"]]

  def show
    render json: Enquiry.find(params[:id])
---
SELECT "enquiries".* FROM "enquiries" WHERE "enquiries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    enquiry = Enquiry.find(params[:id])
    enquiry.update(
      guest_name: params[:guest_name],
      guest_phone: params[:guest_phone],
      guest_email: params[:guest_email],
      room_type: params[:room_type],
      board_type: params[:board_type],
      number_of_guests: params[:number_of_guests],
      start_date: params[:start_date],
      end_date: params[:end_date]
    )
---
SELECT "enquiries".* FROM "enquiries" WHERE "enquiries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "enquiries" SET "guest_name" = $1, "guest_phone" = $2, "guest_email" = $3, "room_type" = $4, "board_type" = $5, "number_of_guests" = $6, "start_date" = $7, "end_date" = $8 WHERE "enquiries"."id" = $9  [["guest_name", nil], ["guest_phone", nil], ["guest_email", nil], ["room_type", nil], ["board_type", nil], ["number_of_guests", nil], ["start_date", nil], ["end_date", nil], ["id", 22]]

  def destroy
    Enquiry.destroy(params[:id])
---
DELETE FROM "enquiries" WHERE "enquiries"."id" = $1  [["id", 2]]