hotel_eel_api/app/controllers/rooms_controller.rb

  def index
    render json: Room.all
---
SELECT "rooms".* FROM "rooms"

  def create
    room = Room.create(room_rate: params[:room_rate], room_occupancy: params[:room_occupancy],
                       room_type: params[:room_type])
---
INSERT INTO "rooms" ("room_type", "room_occupancy", "room_rate") VALUES ($1, $2, $3) RETURNING "id"  [["room_type", "Standard Double"], ["room_occupancy", "3"], ["room_rate", "Ksh 4500"]]

  def show
    render json: Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    room = Room.find(params[:id])
    room.update(room_rate: params[:room_rate], room_occupancy: params[:room_occupancy],
    room_type: params[:room_type])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "rooms" SET "room_type" = $1, "room_occupancy" = $2, "room_rate" = $3 WHERE "rooms"."id" = $4  [["room_type", "Standard Double"], ["room_occupancy", "1"], ["room_rate", "Ksh 5000"], ["id", 1]]

  def destroy
    Room.destroy(params[:id])
---
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 3]]